#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_acm_certificate.amazon_issued: Reading...
data.aws_route53_zone.johnyfoster_zone: Reading...
data.aws_route53_zone.johnyfoster_zone: Read complete after 0s [id=Z00371921B4QSPVT5RTR0]
data.aws_acm_certificate.amazon_issued: Read complete after 0s [id=arn:aws:acm:us-east-2:440141975857:certificate/0e45f006-7135-4394-8867-57bbd9c5635a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.staging.aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 10
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "qa-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + traffic_source (known after apply)
    }

  # module.staging.aws_eip.eip will be created
  + resource "aws_eip" "eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-eip"
          + "Provisionner" = "terraform"
        }
      + tags_all             = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-eip"
          + "Provisionner" = "terraform"
        }
      + vpc                  = (known after apply)
    }

  # module.staging.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-igw"
          + "Provisionner" = "terraform"
        }
      + tags_all = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-igw"
          + "Provisionner" = "terraform"
        }
      + vpc_id   = (known after apply)
    }

  # module.staging.aws_launch_template.lt will be created
  + resource "aws_launch_template" "lt" {
      + arn                                  = (known after apply)
      + default_version                      = (known after apply)
      + id                                   = (known after apply)
      + image_id                             = "ami-085f9c64a9b75eed5"
      + instance_initiated_shutdown_behavior = "terminate"
      + instance_type                        = "t2.micro"
      + key_name                             = "main-us-east-2"
      + latest_version                       = (known after apply)
      + name                                 = "qa-lt"
      + name_prefix                          = (known after apply)
      + tags_all                             = (known after apply)
      + user_data                            = "IyEvYmluL2Jhc2gKc3VkbyBhcHQgdXBkYXRlIC15IApzdWRvIGFwdCBpbnN0YWxsIG5naW54IC15IApzdWRvIGVjaG8gIldlbGNvbWUgdG8gbXkgZmlyc3QgQ2xvdWQgU2VjdXJpdHkgQXBwIiA+PiAvdmFyL3d3dy9odG1sL2luZGV4Lmh0bWw="
      + vpc_security_group_ids               = (known after apply)

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Envinonment"  = "qa"
              + "Name"         = "qa-web"
              + "Provisionner" = "terraform"
            }
        }
    }

  # module.staging.aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "qa-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-lb"
          + "Provisionner" = "terraform"
        }
      + tags_all                                                     = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-lb"
          + "Provisionner" = "terraform"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.staging.aws_lb_listener.forward will be created
  + resource "aws_lb_listener" "forward" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-2:440141975857:certificate/0e45f006-7135-4394-8867-57bbd9c5635a"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "PAGE NOT FOUND. Please check your URL."
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.staging.aws_lb_listener.refirect will be created
  + resource "aws_lb_listener" "refirect" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.staging.aws_lb_listener_rule.rule will be created
  + resource "aws_lb_listener_rule" "rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "qa.johnyfoster.com",
                  + "www.qa.johnyfoster.com",
                ]
            }
        }
    }

  # module.staging.aws_lb_target_group.tg will be created
  + resource "aws_lb_target_group" "tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "qa-80-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-tg"
          + "Provisionner" = "terraform"
        }
      + tags_all                           = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-tg"
          + "Provisionner" = "terraform"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check (known after apply)

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.staging.aws_nat_gateway.ngw will be created
  + resource "aws_nat_gateway" "ngw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-ngw"
          + "Provisionner" = "terraform"
        }
      + tags_all                           = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-ngw"
          + "Provisionner" = "terraform"
        }
    }

  # module.staging.aws_route53_record.www["alias1"] will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.qa.johnyfoster.com"
      + type            = "A"
      + zone_id         = "Z00371921B4QSPVT5RTR0"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.staging.aws_route53_record.www["alias2"] will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "qa.johnyfoster.com"
      + type            = "A"
      + zone_id         = "Z00371921B4QSPVT5RTR0"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.staging.aws_route_table.private_rt will be created
  + resource "aws_route_table" "private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-private-rt"
          + "Provisionner" = "terraform"
        }
      + tags_all         = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-private-rt"
          + "Provisionner" = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.staging.aws_route_table.public_rt will be created
  + resource "aws_route_table" "public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-public-rt"
          + "Provisionner" = "terraform"
        }
      + tags_all         = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-public-rt"
          + "Provisionner" = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # module.staging.aws_route_table_association.private_rt_associations["private-subnet-1"] will be created
  + resource "aws_route_table_association" "private_rt_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.staging.aws_route_table_association.private_rt_associations["private-subnet-2"] will be created
  + resource "aws_route_table_association" "private_rt_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.staging.aws_route_table_association.private_rt_associations["private-subnet-3"] will be created
  + resource "aws_route_table_association" "private_rt_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.staging.aws_route_table_association.public_rt_associations["public-subnet-1"] will be created
  + resource "aws_route_table_association" "public_rt_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.staging.aws_route_table_association.public_rt_associations["public-subnet-2"] will be created
  + resource "aws_route_table_association" "public_rt_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.staging.aws_route_table_association.public_rt_associations["public-subnet-3"] will be created
  + resource "aws_route_table_association" "public_rt_associations" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.staging.aws_security_group.bastion_sg will be created
  + resource "aws_security_group" "bastion_sg" {
      + arn                    = (known after apply)
      + description            = "Allow only SSH inbound traffic and all outbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "qa-bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-bastion-sg"
          + "Provisionner" = "terraform"
        }
      + tags_all               = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-bastion-sg"
          + "Provisionner" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.staging.aws_security_group.private_sg will be created
  + resource "aws_security_group" "private_sg" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP, HTTPS and SSH inbound traffic and all outbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "qa-private-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-private-sg"
          + "Provisionner" = "terraform"
        }
      + tags_all               = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-private-sg"
          + "Provisionner" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.staging.aws_security_group.public_sg will be created
  + resource "aws_security_group" "public_sg" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and HTTPS inbound traffic and all outbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "qa-public-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-public-sg"
          + "Provisionner" = "terraform"
        }
      + tags_all               = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-public-sg"
          + "Provisionner" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.staging.aws_subnet.private_subnets["private-subnet-1"] will be created
  + resource "aws_subnet" "private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.50.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-priv-sub-1"
          + "Provisionner" = "terraform"
        }
      + tags_all                                       = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-priv-sub-1"
          + "Provisionner" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.staging.aws_subnet.private_subnets["private-subnet-2"] will be created
  + resource "aws_subnet" "private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.50.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-priv-sub-3"
          + "Provisionner" = "terraform"
        }
      + tags_all                                       = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-priv-sub-3"
          + "Provisionner" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.staging.aws_subnet.private_subnets["private-subnet-3"] will be created
  + resource "aws_subnet" "private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.50.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-priv-sub-3"
          + "Provisionner" = "terraform"
        }
      + tags_all                                       = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-priv-sub-3"
          + "Provisionner" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.staging.aws_subnet.public_subnets["public-subnet-1"] will be created
  + resource "aws_subnet" "public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.50.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-pub-sub-1"
          + "Provisionner" = "terraform"
        }
      + tags_all                                       = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-pub-sub-1"
          + "Provisionner" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.staging.aws_subnet.public_subnets["public-subnet-2"] will be created
  + resource "aws_subnet" "public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.50.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-pub-sub-3"
          + "Provisionner" = "terraform"
        }
      + tags_all                                       = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-pub-sub-3"
          + "Provisionner" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.staging.aws_subnet.public_subnets["public-subnet-3"] will be created
  + resource "aws_subnet" "public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.50.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-pub-sub-3"
          + "Provisionner" = "terraform"
        }
      + tags_all                                       = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-pub-sub-3"
          + "Provisionner" = "terraform"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.staging.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.50.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-vpc"
          + "Provisionner" = "terraform"
        }
      + tags_all                             = {
          + "Envinonment"  = "qa"
          + "Name"         = "qa-vpc"
          + "Provisionner" = "terraform"
        }
    }

  # module.staging.aws_vpc_security_group_egress_rule.bastion_sg_egress["all-traffic-ipv4"] will be created
  + resource "aws_vpc_security_group_egress_rule" "bastion_sg_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all IPv4 outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.staging.aws_vpc_security_group_egress_rule.private_sg_egress["all-traffic-ipv4"] will be created
  + resource "aws_vpc_security_group_egress_rule" "private_sg_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all IPv4 outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.staging.aws_vpc_security_group_egress_rule.public_sg_egress["all-traffic-ipv4"] will be created
  + resource "aws_vpc_security_group_egress_rule" "public_sg_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all IPv4 outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.staging.aws_vpc_security_group_ingress_rule.bastion_sg_ingress["all-ssh-ipv4"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "bastion_sg_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow SSH IPv4 inbound traffic from anywhere"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 22
    }

  # module.staging.aws_vpc_security_group_ingress_rule.private_sg_ingress["all-http"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "private_sg_ingress" {
      + arn                          = (known after apply)
      + description                  = "Allow all HTTP IPv4 and IPv6 inbound traffic from Public Security Group"
      + from_port                    = 80
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 80
    }

  # module.staging.aws_vpc_security_group_ingress_rule.private_sg_ingress["all-https"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "private_sg_ingress" {
      + arn                          = (known after apply)
      + description                  = "Allow all HTTPS IPv4 and IPv6 inbound traffic from Public Security Group"
      + from_port                    = 443
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 443
    }

  # module.staging.aws_vpc_security_group_ingress_rule.private_sg_ingress["ssh-traffic"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "private_sg_ingress" {
      + arn                          = (known after apply)
      + description                  = "Allow all SSH inbound traffic from Public Security Group"
      + from_port                    = 22
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 22
    }

  # module.staging.aws_vpc_security_group_ingress_rule.public_sg_ingress["all-http-ipv4"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "public_sg_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all HTTP IPv4 inbound traffic"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # module.staging.aws_vpc_security_group_ingress_rule.public_sg_ingress["all-https-ipv4"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "public_sg_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all HTTPS IPv4 inbound traffic"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

Plan: 39 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + certificate_arn = "arn:aws:acm:us-east-2:440141975857:certificate/0e45f006-7135-4394-8867-57bbd9c5635a"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonasfost, Action: `pull_request`, Working Directory: ``, Workflow: `QA Infrastructure Provisionning`*